export interface ICategory{
  category: string,
  services: IService[] 
}

export interface IService{
  name: string,
  description: string,
  price: number
}

export const fetchData = () => Promise.resolve<ICategory[]>([
  {
    "category": "Рентгенографическое исследование",
    "services": [
      {
        "name": "Рентгенографическое исследование в 1 проекции",
        "description": "1 снимок",
        "price": 1700
      },
      {
        "name": "Рентгенографическое исследование в 2 проекциях",
        "description": "2 снимка",
        "price": 2950
      },
      {
        "name": "Рентгенографическое исследование в 3 проекциях",
        "description": "3 снимка",
        "price": 4200
      },
      {
        "name": "Рентгенографическое исследование в 4 проекциях",
        "description": "4 снимка",
        "price": 5500
      },
      {
        "name": "Рентгенографическое исследование в ночное время для исключения патологий, требующих экстренного лечения",
        "description": "1 снимок",
        "price": 1300
      },
      {
        "name": "Рентген брюшной полости",
        "description": "2 снимка",
        "price": 2950
      },
      {
        "name": "Рентген грудной клетки",
        "description": "3 снимка",
        "price": 4200
      },
      {
        "name": "Рентген черепа",
        "description": "3 снимка",
        "price": 3800
      },
      {
        "name": "Рентгенографическое исследование мелких птиц/грызунов (1 проекция)",
        "description": "1 снимок",
        "price": 1600
      },
      {
        "name": "Рентгенографическое исследование крупных птиц (1 проекция)",
        "description": "1 снимок",
        "price": 1600
      },
      {
        "name": "Рентгенографическое исследование мелких птиц ( 2 проекции)",
        "description": "2 снимка",
        "price": 2650
      },
      {
        "name": "Рентгенографическое исследование крупных птиц (2 проекции)",
        "description": "2 снимка",
        "price": 3150
      },
      {
        "name": "Рентгеноконтрастная цистография с учетом уретрального катетера и катетеризации, без стоимости лекарственных препаратов",
        "description": "1 исслед.",
        "price": 6700
      },
      {
        "name": "Рентгеноконтрастное исследование желудочно-кишечного тракта с сульфатом бария, без учета контрастного вещества",
        "description": "серия",
        "price": 8400
      },
      {
        "name": "Введение контрастного вещества с целью проведения миелографии,  включая стоимость контрастного вещества, без стоимости общей анестезии",
        "description": "1 процед.",
        "price": 5250
      },
      {
        "name": "Снимок на дентальном визиографе",
        "description": "1 снимок",
        "price": 650
      },
      {
        "name": "Фистулография, без стоимости контрастного вещества",
        "description": "1 исслед.",
        "price": 3150
      },
      {
        "name": "Экскреторная урография, без стоимости контрастного вещества",
        "description": "1 исслед.",
        "price": 6450
      }
    ]
  },
  {
    "category": "Ультразвуковое исследование",
    "services": [
      {
        "name": "Проведение манипуляций под контролем УЗИ",
        "description": "1 голова",
        "price": 650
      },
      {
        "name": "Пункционная биопсия под контролем УЗИ, с учетом расходных материалов",
        "description": "1 процед.",
        "price": 5750
      },
      {
        "name": "Ультразвуковое исследование брюшной полости детализированное",
        "description": "1 исслед.",
        "price": 4500
      },
      {
        "name": "Ультразвуковое исследование брюшной полости обзорное для онкологических пациентов в динамике",
        "description": "1 исслед.",
        "price": 3050
      },
      {
        "name": "Ультразвуковое исследование брюшной полости у птиц",
        "description": "1 исслед.",
        "price": 1600
      },
      {
        "name": "Ультразвуковое исследование желудочно-кишечного тракта, печени, поджелудочной железы и селезенки",
        "description": "1 исслед.",
        "price": 2100
      },
      {
        "name": "Ультразвуковое исследование желудочно-кишечного тракта",
        "description": "1 исслед.",
        "price": 1300
      },
      {
        "name": "Ультразвуковое исследование глаза и подлежащих структур",
        "description": "1 исслед.",
        "price": 2100
      },
      {
        "name": "Ультразвуковое исследование головного мозга",
        "description": "1 исслед.",
        "price": 2100
      },
      {
        "name": "Ультразвуковое исследование грудной полости",
        "description": "1 исслед.",
        "price": 1900
      },
      {
        "name": "Ультразвуковое исследование одного патологического очага",
        "description": "1 исслед.",
        "price": 650
      },
      {
        "name": "Ультразвуковое исследование двух патологических очагов",
        "description": "1 исслед.",
        "price": 1300
      },
      {
        "name": "Ультразвуковое исследование мочевыделительной системы",
        "description": "1 исслед.",
        "price": 1900
      },
      {
        "name": "Ультразвуковое исследование на выявление сосудистых аномалий",
        "description": "1 исслед.",
        "price": 3200
      },
      {
        "name": "Ультразвуковое исследование на наличие свободной жидкости в брюшной/грудной полости",
        "description": "1 исслед.",
        "price": 650
      },
      {
        "name": "Ультразвуковое исследование надпочечников",
        "description": "1 исслед.",
        "price": 1500
      },
      {
        "name": "Ультразвуковое исследование области шеи (щитовидной и слюнных желез, лимфатических узлов)",
        "description": "1 исслед.",
        "price": 2100
      },
      {
        "name": "Ультразвуковое исследование репродуктивной системы",
        "description": "1 исслед.",
        "price": 2000
      },
      {
        "name": "Холтеровское мониторирование (расшифровка холтера)",
        "description": "1 исслед.",
        "price": 6750
      },
      {
        "name": "Холтеровское мониторирование (установка хол",
        "description": "1 исслед.",
        "price": 750
      },
      {
        "name": "Холтеровское мониторирование (установка и расшифровка холтера)",
        "description": "1 исслед.",
        "price": 7500
      },
      {
        "name": "Скрининг ЭХОКГ (только для кошек)",
        "description": "1 исслед.",
        "price": 2600
      },
      {
        "name": "Фокусное ЭХОКГ",
        "description": "1 исслед.",
        "price": 1300
      },
      {
        "name": "Электрокардиограмма",
        "description": "1 исслед.",
        "price": 1550
      },
      {
        "name": "Предоперационная электрокардиограмма собакам (выполняется кардиологом)",
        "description": "1 исслед.",
        "price": 1800
      },
      {
        "name": "ЭХО-кардиограмма",
        "description": "1 исслед.",
        "price": 3850
      },
      {
        "name": "Комплексное кардиологические исследование сердца перед анестезией",
        "description": "1 комплекс ислед.",
        "price": 5000
      }
    ]
  }
]);